[
  {
    "title": "VR Visual Field Test",
    "slug": "vr_visualfield",
    "description": "VR Visual Field Test is a Unity3D application written to emulate the Humphrey Field Analyzer (HFA) II's visual field test.\nThis test was designed using the FOVE virtual reality headset, because of its integrated eye-tracking.\nFor more information about visual field testing, please refer to <a href=\"https://www.glaucoma.org/treatment/what-is-a-visual-field-test.php\">this article</a> written by the Glaucoma Research Foundation (GRF). ",
    "sections": [
      {
        "image": "application_pattern_01.png",
        "description": "Example pattern that the test iterates over. Only one stimulus (white dot) is visible at any one time. The yellow dot in the middle is a focal point for the patient to focus their eye on."
      },
      {
        "image": "testflow.png",
        "description": "The general flow of the test. This visualizes the process that is followed each time a stimulus is displayed and responded to (or not responded to)."
      },
      {
        "image": "application_ui_demo_01.png",
        "description": "Example of the application's user interface as seen by the test administrator.\n'Threshold Chart' shows established thresholds of stimuli.\n'Current Stimulus' is a blue circle that surrounds the stimulus that was last displayed to the patient.\n'Fixation Graph' is a bar graph that shows the fixation of the patient over time. The bars will directly relate to the distance from the middle focal point to the patient's gaze. These bars are populated dynamically at a rate of 1 per second. 'Current Gaze' shows a real-time representation of where the patient's pupil is looking. This makes it possible for a test administrator to tell if a patient is deviating from the center focal point."
      },
      {
        "image": "application_output_demo_01.png",
        "description": "Output generated by the application. This is a full-length test taken by myself with example patient information entered.\n(Eye-tracking disabled)"
      }
    ]
  },
  {
    "title": "This Website",
    "slug": "website",
    "description": "This website was originally written using basic HTML and CSS. Multiple revisions have been done, including rewriting to better serve mobile users before eventually converting it to an Angular Single Page website.<ul><li><a href=\"https://github.com/JacksonBDuke/angular-website\">Current Iteration</a></li><li><a href=\"https://github.com/JacksonBDuke/website\">Version 2</a></li><li><a href=\"https://bitbucket.org/JacksonBDuke/website/src/master/\">Version 1</a></li></ul>Below are examples from each of these.",
    "sections": [
      {
        "image": "website_old_demo_01.png",
        "description": "The original home page of the website before doing a mobile-focused rewrite."
      },
      {
        "image": "website_old_mobile_demo_01.png",
        "description": "The original home page of the website before mobile-focused rewrite as would be seen on a smaller screen."
      },
      {
        "image": "website_2_demo_01.png",
        "description": "The mobile-focused design. This was still basic HTML & CSS without the use of frameworks."
      },
      {
        "image": "website_2_demo_02.png",
        "description": "Mobile view of the mobile-focused version."
      }
    ]
  },
  {
    "title": "Kickstarter Grabber",
    "slug": "ks_grabber",
    "description": "A Node.js script that grabs new comment, updates, and Kickstarter projects for a defined profile page. This would run every few minutes using Linux crontab on my remote server.<br>A webhook is then used to push these new comments, updates, and projects to a Discord server.<br>Node.js packages including fs, request, and cheerio are utilized.<br><br>You can view the project on my <a href=\"https://github.com/JacksonBDuke/kickstarter\">GitHub</a>.<br><br>Development has stalled as newer versions of the Kickstarter site have made it harder to scrape the necessary information. I may take it back up if I have the time.",
    "sections": [
      {
        "image": "kickstarter_grabber_demo01.png",
        "description": "Example of the script's first run with a defined kickstarter profile. This establishes a list of current comments, projects, etc. with which to compare to later."
      },
      {
        "image": "kickstarter_grabber_demo02.png",
        "description": "Example of various alerts coming from the script to Discord after new comments and projects are found."
      }
    ]
  },
  {
    "title": "TTS DeckBuilder",
    "slug": "tts_deckbuilder",
    "description": "TTS Deck Builder is a small java application that was built to aid in creating deck images for Tabletop Simulator.<br>Images are copied from the system clipboard, added to a list of stored images and then exported to a large tiled image with black borders. The grid output is 10x7 with the last (70th) position reserved for a card-back that is used for when the cards are in an opponent's hand.<br>For example purposes the images used will be solid colors.<br><br>This is a personal project whose development has stalled. I haven't used Tabletop Simulator in a while so have not had much need to use or improve it as of late. You can check out this project's development on its <a href=\"https://github.com/JacksonBDuke/TTS-DeckBuilder/wiki\">GitHub</a> page.<br>I was also working on porting this application to the .NET framework using C# Winforms. ",
    "sections": [
      {
        "image": "tts_deckbuilder_demo_01.png",
        "description": "The initial state of the application. No cards have been copied from the system clipboard so the \"Current Card\" space is blank. Also the \"Export\" button is disabled if the list of cards is empty while the \"Add Card to Deck\" button is disabled if there is no image in the \"Current Card\" area."
      },
      {
        "image": "tts_deckbuilder_demo_02.png",
        "description": "Example of the application state when cards have been added to the deck and there is also an image currently in the \"Current Card\" area waiting to be added to the deck or replaced by another \"Grab from Clipboard\" execution. "
      },
      {
        "image": "tts_deckbuilder_demo_04.png",
        "description": "Current Settings window."
      },
      {
        "image": "tts_deckbuilder_demo_05.png",
        "description": "Example deck image that this application exports."
      }
    ]
  }
]
